# --- Shell ---
brew "git"
brew "bash"
brew "starship"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "jq"
brew "coreutils"
brew "cmake"
brew "btop"

# --- Shell Plugins ---
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Libraries ---
brew "libpq"
brew "gdal"

# --- Languages & Build ---
brew "openjdk@17"
brew "openjdk@21"
brew "openjdk@25"
brew "maven"
brew "gradle"
brew "jenv"
brew "fnm"
brew "pnpm"
brew "uv"
brew "rustup"

# --- Containers ---
brew "colima"
brew "docker"
brew "docker-compose"

# --- Cloud & DevOps ---
brew "azure-cli"
brew "openshift-cli"
brew "kubernetes-cli"
brew "helm"
brew "kcat"

# --- GUI Apps ---
cask "iterm2"
cask "rectangle"
cask "stats"
cask "jetbrains-toolbox"
cask "font-jetbrains-mono-nerd-font"
cask "visual-studio-code"
cask "bruno"
cask "obsidian"
cask "dbeaver-community"
cask "google-chrome"
cask "firefox"
cask "spotify"
cask "qgis"
cask "r-app"
cask "rstudio"
cask "xquartz"
