coreutils
curl
gdal
geos
git
glances
grep
node
openblas
openssl
pandoc
perl
pkg-config
postgres
proj
pyenv
qt
ruby
spatialindex
tree
wget
