bash
coreutils
curl
cookiecutter
ffmpeg
gdal
gdb
geos
git
glances
graphviz
grep
java
kubectl
llvm
maven
minikube
nmap
node
nvm
openblas
openssl
pandoc
perl
pkg-config
poetry
postgres
proj
pyenv
qt
ruby
spatialindex
sqlmap
starship
tree
wget
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
